app/controllers/users_controller.rb

  def show

    myposts = ""
    if params[:id]
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)